{"_path":"/pt","_dir":"","_draft":false,"_partial":false,"_locale":"en","header":{"title":"Oi, eu sou Humberto.","body":"Designer, desenvolvedor web e artista 3D com um olho aguçado para criar interfaces de usuário envolventes."},"works":{"title":"Trabalhos","labels":{"position":"Cargo","org":"Organização","year":"Ano","work":"Trabalho"},"projects":[{"title":"Coletor App Mobile","description":"Aplicativo mobile de gerenciamento de estoques","company":"Ravaneda C&T","img":"/img/covers/cover-coletor.png","label":{"position":"UX Designer","org":"Ravaneda C&T","year":"2022","work":["Prototipação de baixa fidelidade","Fluxo de navegação"]},"tags":["UX Design"],"body":[{"title":"Projeto","paragraphs":["Desenvolver um aplicativo Android para tablets para auxiliar o serviço gerenciamento de carga, descarga e movimentação de mercadorias de uma empresa de depósito portuário."],"img":"","alt":""},{"title":"Mapeamento","paragraphs":["Primeiro foram mapeados os processos atuais da empresa, que eram executados via SAP. Uma vez identificados os padrões, foram discutidas novas abordagens para a simplificação dos processos com os stakeholders."],"img":"/img/coletor/fluxo.png","alt":"Digrama de fluxo de telas."},{"title":"Prototipação","paragraphs":["Definida a abordagem, foram desenvolvidos protótipos das telas em baixa fidelidade, utilizando a biblioteca de componentes do Bootstrap de base."],"img":"/img/coletor/telas.png","alt":"Exemplos dos protótipos desenvolvidos."},{"title":"Ferramentas","paragraphs":["Foram utilizados FigJam e Figma para a documentação de fluxos de navegação e prototipação, respectivamente, junto com as bibliotecas de componentes e ícones do Bootstrap. O gerenciamento de tarefas foi feito com ClickUp."],"img":"","alt":""}]},{"title":"SPB Web App","description":"Aplicativo de gerenciamento de trabalho e equipes.","company":"Siapro Sistemas","img":"/img/covers/cover-spb.png","label":{"position":"UX|UI Designer","org":"Siapro Sistemas","year":"2022","work":["Criação de sistema de design","Prototipação de alta fidelidade"]},"tags":["UX Design","UI Design"],"body":[{"title":"Projeto","paragraphs":["Auxiliar na atualização da base de um aplicativo web para o gerenciamento de trabalho e equipes. O projeto já estava em desenvolvimento e havia entrado em revisão do fluxo de navegação e de interface."],"img":"","alt":""},{"title":"Mapeamento","paragraphs":["A versão atual do app foi segmentada e documentada, servindo de base para os ajustes e criação de novos fluxos de navegação."],"img":"","alt":""},{"title":"Sistema de Design","paragraphs":["A cada ramificação do fluxo de navegação eram estudadas melhorias na apresentação dos dados de cada interface. A partir dessas observações e de pesquisas técnicas de interfaces  foi desenvolvido a base do novo sistema, que embasava referencialmente as soluções para as necessidades futuras."],"img":"/img/spb/paletas.png","alt":"Paletas de cores e variações tipográficas."},{"title":"Componentização","paragraphs":["Foi criada a biblioteca de componentes para aplicar o sistema de design de modo uniforme na criação, manutenção e futura programação das telas."],"img":"/img/spb/componentes.png","alt":"Componentes de menu lateral e popup de pesquisa."},{"title":"Prototipação","paragraphs":["Com os componentes prontos, os protótipos de alta fidelidade eram criados para a revisão com os StakeHolder e alinhamento com a equipe de desenvolvimento."],"img":"/img/spb/telas.png","alt":"Prototipos em versão clara e escura."},{"title":"Ferramentas","paragraphs":["Foram utilizados FigJam e Figma para a documentação de fluxos de navegação e prototipação, respectivamente, junto com as bibliotecas de componentes e ícones do Bootstrap. O gerenciamento de tarefas foi feito com Jira."],"img":"","alt":""}]},{"title":"Nós App","description":"Aplicativo web e mobile para doações a ongs","company":"UTFPR","img":"/img/covers/cover-nos.png","label":{"position":"Desenvolvedor Voluntário","org":"UTFPR","year":"2022","work":["Desenvolvimento React"]},"tags":["React","Nodejs","MongoDB"],"body":[{"title":"Projeto","paragraphs":["Um aplicativo catalisador de instituições de ajuda humanitária e animal que auxilia os usuários a fazerem doações direcionadas para as necessidades de cada organização."],"img":"/img/nos/home.png","alt":"Tela home da versão web."},{"title":"Rotina","paragraphs":["Desenvolvimento de componentes e páginas para a aplicação web, criação de rotas, filtragem regex de formulários, correções de bug e contribuição com sugestões de software para a stack da equipe."],"img":"/img/nos/nos.png","alt":"Sessão de links e doações."},{"title":"Ferramentas","paragraphs":["Foram utilizados FigJam e Figma para a documentação de fluxos de navegação e prototipação, respectivamente. A Stack era React Native com MongoDB. O gerenciamento de tarefas era feito pelo ClickUp com metodologia Ágil Scrum."],"img":"","alt":""}]},{"title":"Mediação Ping Pong","description":"Projeto de acessibilidade cultural","company":"MAM-RJ & eLaborando","img":"/img/covers/cover-ping-pong.png","label":{"position":"Artista 3D | Designer","org":"UTFPR","year":"2021","work":["Modelagem 3D","Criação de identidade","Edição de vídeo"]},"tags":["3D","Branding","Edição de Vídeo"],"body":[{"title":"Contexto","paragraphs":["O projeto de Mediação Ping-Pong nasceu do Hack Acessível, maratona de criação de ideias para propostas de acessibilidade a pessoas com deficiência no universo da cultura, realizado no início de 2021 com profissionais de produção e acessibilidade da Rede eLABorando. Seu objetivo é estabelecer um espaço de diálogo e criação de conteúdo com e para pessoas com deficiência nas atividades do MAM."],"img":"","alt":""},{"title":"Projeto","paragraphs":["Reproduzir miniaturas de esculturas da exposição Estado Bruto com impressão 3D, para que pessoas com deficiências visuais possam interagir com estas obras, tocando-as e sentindo-as. Um encontro futuro entre participantes e membros da equipe de curadoria do MAM - RJ documenta a experiência dos participantes em justaposto com o discurso da peça da perspectiva do museu."],"img":"/img/pingpong/renders.png","alt":"Renders das peças já esculpidas."},{"title":"Processo","paragraphs":["As peças foram esculpidas no Blender, a partir de fotos tiradas pela equipe. Depois os arquivos foram enviados ao eLaborando para impressão e envio para os participantes."],"img":"/img/pingpong/pecas.png","alt":"Comparativo entre as esculturas originais e as miniaturas impressas."},{"title":"Entrevistas","paragraphs":["Os encontros entre os participantes foram editados, adicionada  a tradução para Libras e a aplicação da identidade visual do projeto."],"img":"/img/pingpong/entrevista.png","alt":"Frame da conversa entre Gisele e Daniel."},{"title":"Ferramentas","paragraphs":["Foi utilizado Blender para esculpir as peças, Adobe Illustrator para criação da identidade visual e o Kdenlive para edição de vídeo."],"img":"","alt":""}]},{"title":"Céu Brasileiro Bot","description":"Trabalho de Conclusão de Curso.","company":"UTFPR","img":"/img/covers/cover-ceu.png","label":{"position":"Estudante","org":"UTFPR","year":"2021","work":["Desenvolvimento full stack","Criação de base de dados","Gerenciamento de servidor"]},"tags":["NodeJs","MongoDB"],"body":[{"title":"Projeto","paragraphs":["Memorial virtual dedicado às vítimas de COVID-19 no Brasil. Usa Node.js para consumir APIs, gerar GIFs e publicar no Twitter."],"img":"/img/ceubr/output.gif","alt":"Exemplo de uma das imagens geradas pelo bot."},{"title":"Ferramentas","paragraphs":["Foram utilizados Nodejs, para consumo de APIs, P5js para criação de gráficos e exportação de gifs e MongoDB para gerenciamento de interações."],"img":"","alt":""}]},{"title":"Coleção Mischievous","description":"Peça publicitária em 3D","company":"Mischievous","img":"/img/covers/cover-mischievous.png","label":{"position":"Artista 3D","org":"Mischievous","year":"2020","work":["Modelagem 3D","Animação"]},"tags":["Modelagem 3D","Animação"],"body":[{"title":"Projeto","paragraphs":["Artes 3D feitas para a divulgação de óculos e colares da marca. Modelagem dos produtos com base em fotos e ambientação orgânica adequados à estética do desfile de outras peças da marca, apresentadas na Casa de Criadores em 2020."],"img":"/img/mischievous/renders.png","alt":"Frames do vídeo final lançado nas redes sociais."},{"title":"Ferramentas","paragraphs":["Foi utilizado Blender para esculpir as peças, compor ambientação e renderização."],"img":"","alt":""}]}]},"navbar":{"navigation":[{"name":"Trabalhos","href":"#trabalho","current":false},{"name":"Contato","href":"#contato","current":false}],"ids":["trabalho","contato"],"links":[{"name":"LinkedIn","href":"https://www.linkedin.com/in/salguento","icon":"mdi:linkedin"},{"name":"Github","href":"https://github.com/salguento","icon":"mdi:github"},{"name":"Mastodon","href":"https://ursal.zone/@salguento","icon":"mdi:mastodon"}],"about":{"btn":{"img":"/img/profile.jpeg","alt":"Sobre Humberto"},"body":{"title":"Olá!","description":["Designer Visual há 10 anos, desenvolvi peças de comunicação e marketing para meios impressos e digitais, como posts, vídeos, e-mails e landing pages.","Desde 2021, eu transiciono entre Design UI-UX e desenvolvimento web.","Atualmente contribuo em duas start-ups com a organização, planejamento e execução dos projetos nas duas áreas.","Entusiasta de arte, tecnologia e software livre."],"img":"/img/profile.jpeg"}}},"clients":[{"name":""}],"contact":{"title":"Vamos trabalhar juntos!","body":["Tem um projeto com o qual eu possa contribuir?","Envie-me um e-mail, e vamos conversar."]},"_id":"content:pt.json","_type":"json","title":"Pt","_source":"content","_file":"pt.json","_extension":"json"}