{"_path":"/en","_dir":"","_draft":false,"_partial":false,"_locale":"en","header":{"title":"Hi, I'm Humberto.","body":"A Brazilian Designer, Web Developer and 3D Artist with a keen eye for creating engaging user interfaces."},"works":{"title":"Works","labels":{"position":"Role","org":"Org","year":"Year","work":"Work"},"projects":[{"title":"Coletor Mobile App","description":"Inventory management mobile application","company":"Ravaneda C&T","img":"/img/covers/cover-coletor.png","label":{"position":"UX Designer","org":"Ravaneda C&T","year":"2022","work":["Low-fidelity prototyping","Navigation flow"]},"tags":["UX Design"],"body":[{"title":"Project","paragraphs":["Develop an Android application for tablets to assist the service management of loading, unloading, and movement of goods for a port warehouse company."],"img":"","alt":""},{"title":"Mapping","paragraphs":["First the company's current processes, which were run via SAP, were mapped. Once patterns were identified, new approaches for simplifying the processes were discussed with stakeholders."],"img":"/img/coletor/fluxo.png","alt":"Screen flow diagram."},{"title":"Prototyping","paragraphs":["Once the approach was defined, prototypes of the screens were developed in low fidelity, using the base Bootstrap component library."],"img":"/img/coletor/telas.png","alt":"Examples of the prototypes developed."},{"title":"Tools","paragraphs":["FigJam and Figma were used for documenting navigation and prototyping flows, respectively, along with Bootstrap's component and icon libraries. Task management was done with ClickUp."],"img":"","alt":""}]},{"title":"SPB Web App","description":"Work and team management application.","company":"Siapro Sistemas","img":"/img/covers/cover-spb.png","label":{"position":"UX|UI Designer","org":"Siapro Sistemas","year":"2022","work":["Design system creation","High-fidelity prototyping"]},"tags":["UX Design","UI Design"],"body":[{"title":"Project","paragraphs":["Assist in updating the basis of a web application for managing work and teams. The project was already under development and had gone into navigation and interface flow review."],"img":"","alt":""},{"title":"Mapping","paragraphs":["The current version of the app has been segmented and documented, serving as a basis for the adjustments and creation of new navigation flows."],"img":"","alt":""},{"title":"Design System","paragraphs":["At each branch of the navigation flow, improvements in the presentation of data on each interface were studied. From these observations and from technical research on interfaces, the base of the new system was developed, which based the solutions for future needs."],"img":"/img/spb/paletas.png","alt":"Color palettes and typographic variations."},{"title":"Components","paragraphs":["The component library was created to apply the design system in a uniform way to the creation, maintenance and future programming of the screens."],"img":"/img/spb/componentes.png","alt":"Side menu and search popup components."},{"title":"Prototyping","paragraphs":["With the components ready, high-fidelity prototypes were created for review with StakeHolder and alignment with the development team."],"img":"/img/spb/telas.png","alt":"Prototypes in light and dark versions."},{"title":"Tools","paragraphs":["FigJam and Figma were used for documenting navigation and prototyping flows, respectively, along with Bootstrap's component and icon libraries. Task management was done with Jira."],"img":"","alt":""}]},{"title":"Nós App","description":"Web and mobile application for donations to ngos","company":"UTFPR","img":"/img/covers/cover-nos.png","label":{"position":"Volunteer Developer","org":"UTFPR","year":"2022","work":["React Development"]},"tags":["React","Nodejs","MongoDB"],"body":[{"title":"Project","paragraphs":["A catalyst app for animal and humanitarian aid organizations that helps users make donations targeted to the needs of each organization."],"img":"/img/nos/home.png","alt":"Home screen of the web version."},{"title":"Routine","paragraphs":["Developing components and pages for the web application, creating routes, regex filtering of forms, bug fixes, and contributing software suggestions to the team stack."],"img":"/img/nos/nos.png","alt":"Links and donations session."},{"title":"Tools","paragraphs":["FigJam and Figma were used for documenting navigation and prototyping flows, respectively. The Stack was React Native with MongoDB. Task management was done by ClickUp with Agile Scrum methodology."],"img":"","alt":""}]},{"title":"Mediação Ping Pong","description":"Projeto de acessibilidade cultural","company":"MAM-RJ & eLaborando","img":"/img/covers/cover-ping-pong.png","label":{"position":"3D Artist  | Designer","org":"UTFPR","year":"2021","work":["3D Modeling","Branding","Video editing"]},"tags":["3D","Branding","Video editing"],"body":[{"title":"Context","paragraphs":["The Ping-Pong Mediation project was born from the Accessible Hack, a marathon for the creation of ideas for accessibility proposals for people with disabilities in the universe of culture, held in early 2021 with production and accessibility professionals from the eLABorando Network. Its goal is to establish a space for dialogue and content creation with and for people with disabilities in MAM's activities."],"img":"","alt":""},{"title":"Project","paragraphs":["Reproduce miniature sculptures from the exhibition Raw State with 3D printing, so that people with visual impairments can interact with these works, touching and feeling them. A future meeting between participants and members of the MAM - RJ curatorial team documents the participants' experience in juxtaposition with the discourse of the piece from the museum's perspective."],"img":"/img/pingpong/renders.png","alt":"Renders das peças já esculpidas."},{"title":"Process","paragraphs":["The pieces were sculpted in Blender, from photos taken by the team. Then the files were sent to eLaborando to be printed and sent to the participants."],"img":"/img/pingpong/pecas.png","alt":"Comparison between the original sculptures and the printed miniatures."},{"title":"Interviews","paragraphs":["The meetings between the participants were edited, translation into Libras was added, and the visual identity of the project was applied."],"img":"/img/pingpong/entrevista.png","alt":"Frame da conversa entre Gisele e Daniel."},{"title":"Tools","paragraphs":["Blender was used to sculpt the pieces, Adobe Illustrator to create the visual identity, and Kdenlive for video editing."],"img":"","alt":""}]},{"title":"Céu Brasileiro Bot","description":"Graduation thesis","company":"UTFPR","img":"/img/covers/cover-ceu.png","label":{"position":"Student","org":"UTFPR","year":"2021","work":["Full stack development","MongoDB","Server management"]},"tags":["NodeJs","MongoDB"],"body":[{"title":"Project","paragraphs":["Virtual memorial dedicated to the victims of COVID-19 in Brazil. Uses Node.js to consume APIs, generate GIFs, and publish to Twitter."],"img":"/img/ceubr/output.gif","alt":"Example of one of the images generated by the bot."},{"title":"Tools","paragraphs":["Nodejs was used for API consumption, P5js for graph creation and gif export, and MongoDB for interaction management."],"img":"","alt":""}]},{"title":"Mischievous Collection","description":"3D advertising piece","company":"Mischievous","img":"/img/covers/cover-mischievous.png","label":{"position":"3D Artist","org":"Mischievous","year":"2020","work":["3D Modeling","Animation"]},"tags":["3D Modeling","Animation"],"body":[{"title":"Project","paragraphs":["3D arts made for the promotion of the brand's glasses and necklaces. Modeling of products based on photos and organic ambiance appropriate to the aesthetics of the parade of other pieces of the brand, presented at Casa de Criadores (São Paulo / Brazil) in 2020."],"img":"/img/mischievous/renders.png","alt":"Frames from the final video released on social media."},{"title":"Tools","paragraphs":["Blender was used to sculpt the pieces, compose ambiance, and render."],"img":"","alt":""}]}]},"navbar":{"navigation":[{"name":"Work","href":"#work","current":false},{"name":"Contact","href":"#contact","current":false}],"ids":["work","contact"],"links":[{"name":"LinkedIn","href":"https://www.linkedin.com/in/salguento","icon":"mdi:linkedin"},{"name":"Github","href":"https://github.com/salguento","icon":"mdi:github"},{"name":"Mastodon","href":"https://ursal.zone/@salguento","icon":"mdi:mastodon"}],"about":{"btn":{"img":"/img/profile.jpeg","alt":"About Humberto"},"body":{"title":"Hi!","description":["A visual designer for 10 years, I have developed communication and marketing pieces for print and digital media, such as posts, videos, emails, and landing pages.","Since 2021, I transition between UI-UX Design and web development.","Currently I contribute in two start-ups with the organization, planning and execution of projects in both areas.","Art, technology and free software enthusiast."],"img":"/img/profile.jpeg"}}},"clients":[{"name":""}],"contact":{"title":"Let's work together!","body":["Do you have a project that I can contribute to?","Send me an e-mail, and let's talk."]},"_id":"content:en.json","_type":"json","title":"En","_source":"content","_file":"en.json","_extension":"json"}